
## L10 Thinking
**1.排序模型按照样本生成方法和损失函数的不同，可以划分成Pointwise, Pairwise, Listwise三类方法，这三类排序方法有何区别**         
Pointwise方法类似常见的推荐系统方法，doc和query作为一条数据，特征一般是doc本身的特征或者doc和query相互关系特征等，label一般是相关性得分，可以是简单的相关与否，点击与否，也可以是进阶的用户行为购买收藏等转化的得分。得分的高低可以一定程度上代表相关性强弱，但是不能表达doc之间的相互顺序。      
Pairwise是把同一查询下两个文档组成一对，学习对象包含了两个文档的前后顺序。比如1代表doc1在doc2之前，-1代表doc1在doc2之后。Pairwise没有考虑文档出现在搜索列表中的位置，不同的查询，其相关文档数量差异很大，转换为文档对之后，有的查询可能有几百对文档，有的可能只有几十个，最终对机器学习的效果评价造成困难。     
Listwise方法是将每一个查询对应的所有搜索结果列表整体作为一个训练实例，根据训练样例训练得到最优评分函数F，对应新的查询，评分F对每个文档打分，然后根据得分由高到低排序，即为最终的排序结果。
      
**2.排序模型按照结构划分，可以分为线性排序模型、树模型、深度学习模型，这些模型都有哪些典型的代表？**                
线性模型LR，引入自动二阶交叉特征的FM和FFM。         
树模型GBDT+LR。     
深度学习模型RankNet，LambdaRank和LambdaMART等，DNN模型，Wide & Deep, DeepFM, NFM等


**3.NDCG如何计算**                  
CG累计增益，所有文档相关性累加。  
DCG折损累计增益，在每一个CG的结果上除以一个折损值，为了让排名靠前的结果能影响最后的结果，排序越往后价值越低。到第i个位置的时候，价值是 1/log2(i+1)，那么第i个结果产生的效益就是 reli * 1/log2(i+1)，全部累加。      
IDCG 理想情况下最大的DCG值,结果按照相关性从大到小的顺序排序，取前p个结果组成的集合。也就是按照最优的方式对结果进行排序。    
NDCG 标准化累积收益，NDCG=DCG/IDCG

**4.搜索排序和推荐系统的相同和不同之处有哪些**          
都是基于重要性和相关度的召回排序并推荐呈现。    
搜索排序基于某Query进行的结果排序，期望用户选中的在排序结果中是靠前的，是有意识的目的性强的被动推荐。要尽可能的把相关度最高的内容靠前推荐。
             
推荐系统，基于历史行为或者相似邻域的“猜你喜欢”。采用pointwise模型较多，预测出来的分数，代表了目标用户点击item的预测概率。 推荐是发散的、无意识的主动推荐，相比search而言，排序准确性要求不高。推荐系统也应考虑多样性，探索用户的新兴趣。


**5.Listwise排序模型能否应用到推荐系统中**      
可以，但是很少。推荐系统主要用pointwise 方法。因为推荐系统中对排序的要求不高。Listwise对于排序学习效果更好，但计算量巨大。推荐系统也应考虑多样性，推荐的时候可以适当探索相关度低的物品，提高多样性。         







